stress-test/pilot-auth-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 2m0s (gracefulStop: 30s)

time="2026-01-16T12:46:58-05:00" level=info msg="🔐 Obteniendo token de autenticación..." source=console

Run       [ 100% ] setup()
default   [   0% ]


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0/s

    http_req_duration
    ✓ 'p(95)<1000' p(95)=363.34ms
    ✓ 'p(99)<2000' p(99)=363.34ms

    http_req_failed
    ✗ 'rate<0.05' rate=100.00%


  █ TOTAL RESULTS 

    CUSTOM
    errors..............: 0       0/s

    HTTP
    http_req_duration...: avg=363.34ms min=363.34ms med=363.34ms max=363.34ms p(90)=363.34ms p(95)=363.34ms
    http_req_failed.....: 100.00% 1 out of 1
    http_reqs...........: 1       0.525942/s

    EXECUTION
    vus.................: 0       min=0      max=0  
    vus_max.............: 100     min=100    max=100

    NETWORK
    data_received.......: 4.8 kB  2.5 kB/s
    data_sent...........: 1.9 kB  986 B/s



Run       [ 100% ] setup()
default   [   0% ]
time="2026-01-16T12:47:00-05:00" level=error msg="Error: Failed to get auth token: 401 {\"error\":\"Unauthorized\"}\n\tat setup (file:///home/ubuntu/piano-emotion-manager/stress-test/stress-test.js:58:11(40))\n" hint="script exception"